Repository: dbaio/weblate_fbsd_doc_test
Catalog: articles/*/new-users.po
Languages: pt_br

source: If you get tired of waiting, press <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo> to get another <firstterm>virtual console</firstterm>, and log in again. After all, it is a multi-user, multi-tasking system. Nevertheless these commands will probably flash messages on your screen while they are running; you can type <command>clear</command> at the prompt to clear the screen. Once they have run, you might want to look at <filename>/var/mail/root</filename> and <filename>/var/log/messages</filename>.
pt_br: Se você se cansar de esperar, pressione <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo>para obter outro <firstterm>virtual console</firstterm>, e efetuar login novamente. Afinal, é um sistema multi-usuário e multitarefa. No entanto, esses comandos provavelmente irão piscar mensagens na tela enquanto eles estiverem em execução; você pode digitar <command>clear</command> no prompt para limpar a tela. Uma vez executados, você pode querer olhar o conteúdo de <filename>/var/mail/root</filename> e <filename>/var/log/messages</filename>.

source: Running such commands is part of system administration—and as a single user of a <trademark class="registered">UNIX</trademark> system, you are your own system administrator. Virtually everything you need to be <systemitem class="username">root</systemitem> to do is system administration. Such responsibilities are not covered very well even in those big fat books on <trademark class="registered">UNIX</trademark>, which seem to devote a lot of space to pulling down menus in windows managers. You might want to get one of the two leading books on systems administration, either Evi Nemeth et.al.'s <citetitle>UNIX System Administration Handbook</citetitle> (Prentice-Hall, 1995, ISBN 0-13-15051-7)—the second edition with the red cover; or Æleen Frisch's <citetitle>Essential System Administration</citetitle> (O'Reilly &amp; Associates, 2002, ISBN 0-596-00343-9). I used Nemeth.
pt_br: A execução de tais comandos faz parte da administração do sistema—e como usuário único de um sistema <trademark class="registered">UNIX</trademark>, você é seu próprio administrador de rede. Praticamente tudo o que você precisa para ser <systemitem class="username">root</systemitem> é administrar o sistema. Tais responsabilidades não são abordadas nem mesmo naqueles livros gigantescos no <trademark class="registered">UNIX</trademark>, os quais parecem dedicar muito espaço para menus e gerenciador de janelas. ,Você pode querer obter um dos dois principais livros sobre administração de sistemas, pode ser o Evi Nemeth et.al.'s <citetitle>UNIX System Administration Handbook</citetitle> (Prentice-Hall, 1995, ISBN 0-13-15051-7)—a segunda edição com a capa vermelha; ou o livro Æleen Frisch's <citetitle>Essential System Administration</citetitle> (O'Reilly &amp; Associates, 2002, ISBN 0-596-00343-9). Eu usei Nemeth.

source: Editing Text
pt_br: Editando texto

source: To configure your system, you need to edit text files. Most of them will be in the <filename>/etc</filename> directory; and you will need to <command>su</command> to <systemitem class="username">root</systemitem> to be able to change them. You can use the easy <command>ee</command>, but in the long run the text editor <command>vi</command> is worth learning. There is an excellent tutorial on vi in <filename>/usr/src/contrib/nvi/docs/tutorial</filename>, if you have the system sources installed.
pt_br: Para configurar o seu sistema, você precisará editar arquivos de texto. A maioria deles estará no diretório <filename>/etc</filename>; e você precisará utilizar o comando <command>su</command> para acessar o usuário <systemitem class="username">root</systemitem> do sistema e assim poder alterá-los. Você pode utilizar um editor de texto simples, como o <command>ee</command>, mas a longo prazo, é recomendado aprender a utilizar o editor de texto <command>vi</command>. Existe um excelente tutorial do editor de texto vi disponível em <filename>/usr/src/contrib/nvi/docs/tutorial</filename>, se você tiver as fontes do sistema instaladas.

source: Before you edit a file, you should probably back it up. Suppose you want to edit <filename>/etc/rc.conf</filename>. You could just use <command>cd /etc</command> to get to the <filename>/etc</filename> directory and do:
pt_br: Antes de editar um arquivo, é recomendado criar um backup do mesmo. Suponha que você queira editar o <filename>/etc/rc.conf</filename>. Você poderia usar apenas <command>cd /etc</command> para acessar o diretório <filename>/etc</filename> e usar o seguinte comando:

source: This would copy <filename>rc.conf</filename> to <filename>rc.conf.orig</filename>, and you could later copy <filename>rc.conf.orig</filename> to <filename>rc.conf</filename> to recover the original. But even better would be moving (renaming) and then copying back:
pt_br: Isso iria copiar <filename>rc.conf</filename> para <filename>rc.conf.orig</filename>, e após isso você poderia copiar <filename>rc.conf.orig</filename> para <filename>rc.conf</filename> para recuperar o original. Mas melhor ainda seria mover (renomear) e depois copiar de volta:

source: because the <command>mv</command> command preserves the original date and owner of the file. You can now edit <filename>rc.conf</filename>. If you want the original back, you would then <userinput>mv rc.conf rc.conf.myedit</userinput> (assuming you want to preserve your edited version) and then
pt_br: porque o comando <command>mv</command> preserva a data original e o proprietário do arquivo. Agora você pode editar o <filename>rc.conf</filename>. Se você quiser o original de volta, você deve então executar <userinput>mv rc.conf rc.conf.myedit</userinput> (considerando que você quer preservar sua versão editada) e então

source: to put things back the way they were.
pt_br: para colocar as coisas de volta da maneira que estavam.

source: To edit a file, type
pt_br: Para editar um arquivo, digite

source: <prompt>#</prompt> <userinput>vi <replaceable>filename</replaceable></userinput>
pt_br: <prompt>#</prompt> <userinput>vi <replaceable>arquivo</replaceable></userinput>

source: Move through the text with the arrow keys. <keycap>Esc</keycap> (the escape key) puts <command>vi</command> in command mode. Here are some commands:
pt_br: Movimente-se através do texto com as teclas direcionadoras. <keycap>Esc</keycap> (a tecla de escape) coloca o editor <command>vi</command> em modo de comando. Aqui estão alguns comandos:

source: delete letter the cursor is on
pt_br: deleta a letra localizada onde o cursor está

source: delete the entire line (even if it wraps on the screen)
pt_br: Apaga a linha inteira (mesmo se ela não estiver por inteiro aparecendo na tela)

source: insert text at the cursor
pt_br: Insere um texto na posição do cursor

source: insert text after the cursor
pt_br: Insere um texto após a posição do cursor

source: Once you type <command>i</command> or <command>a</command>, you can enter text. <command>Esc</command> puts you back in command mode where you can type
pt_br: Uma vez que você digitou <command>i</command> ou <command>a</command>, você pode entrar com o texto. Se você pressionar <command>Esc</command> você colocará novamente o editor em modo de comando, e lá será onde você irá digitar

source: to write your changes to disk and continue editing
pt_br: para escrever suas alterações no disco e continuar editando

source: to write and quit
pt_br: para gravar e sair

source: to quit without saving changes
pt_br: para finalizar sem salvar as alterações

source: <command>/<replaceable>text</replaceable></command>
pt_br: <command>/<replaceable>texto</replaceable></command>

source: to move the cursor to <replaceable>text</replaceable>; <command>/</command><keycap>Enter</keycap> (the enter key) to find the next instance of <replaceable>text</replaceable>.
pt_br: para mover o cursor para o <replaceable>texto</replaceable>; <command>/</command><keycap>Enter</keycap> (a tecla Enter) para encontrar a próxima ocorrência do <replaceable>texto</replaceable>.

source: to go to the end of the file
pt_br: para ir para o final do arquivo

source: to go to line <replaceable>n</replaceable> in the file, where <replaceable>n</replaceable> is a number
pt_br: para ir para a linha <replaceable>n</replaceable> dentro do arquivo em edição, onde <replaceable>n</replaceable> é um número

source: to redraw the screen
pt_br: para recarregar a tela

source: <keycombo><keycap>Ctrl</keycap><keycap>b</keycap></keycombo> and <keycombo><keycap>Ctrl</keycap><keycap>f</keycap></keycombo>
pt_br: <keycombo><keycap>Ctrl</keycap><keycap>b</keycap></keycombo> e <keycombo><keycap>Ctrl</keycap><keycap>f</keycap></keycombo>

source: go back and forward a screen, as they do with <command>more</command> and <command>view</command>.
pt_br: voltar e avançar uma tela, como fazem com <command>more</command> e <command>view</command>.

source: Practice with <command>vi</command> in your home directory by creating a new file with <command>vi <replaceable>filename</replaceable></command> and adding and deleting text, saving the file, and calling it up again. <command>vi</command> delivers some surprises because it is really quite complex, and sometimes you will inadvertently issue a command that will do something you do not expect. (Some people actually like <command>vi</command>—it is more powerful than DOS EDIT—find out about the <command>:r</command> command.) Use <keycap>Esc</keycap> one or more times to be sure you are in command mode and proceed from there when it gives you trouble, save often with <command>:w</command>, and use <command>:q!</command> to get out and start over (from your last <command>:w</command>) when you need to.
pt_br: Pratique com o <command>vi</command> em seu diretório home criando um novo arquivo com <command>vi <replaceable>filename</replaceable></command> e adicionando e excluindo texto, salvando o arquivo, e o chamando novamente. O <command>vi</command> oferece algumas surpresas porque ele realmente é muito complexo e, às vezes, você irá executar um comando que fará algo que você não espera. (Algumas pessoas realmente gostam do <command>vi</command>—é mais poderoso que o DOS EDIT—saiba mais sobre o comando <command>:r</command>.) Use <keycap>Esc</keycap> uma ou mais vezes para ter certeza de que você está no modo de comando e prossiga dali quando ele lhe der problema, salve frequentemente com <command>:w</command>, e use <command>:q!</command> para sair e começar novamente (do seu último <command>:w</command>) quando você precisar.

source: Now you can <command>cd</command> to <filename>/etc</filename>, <command>su</command> to <systemitem class="username">root</systemitem>, use <command>vi</command> to edit the file <filename>/etc/group</filename>, and add a user to <systemitem class="groupname">wheel</systemitem> so the user has root privileges. Just add a comma and the user's login name to the end of the first line in the file, press <keycap>Esc</keycap>, and use <command>:wq</command> to write the file to disk and quit. Instantly effective. (You did not put a space after the comma, did you?)
pt_br: Agora você pode <command>cd</command> em <filename>/etc</filename>, use o <command>su</command> para logar como <systemitem class="username">root</systemitem>, use <command>vi</command> para editar o arquivo <filename>/etc/group</filename>, e adicione um usuário ao grupo <systemitem class="groupname">wheel</systemitem>, assim, o usuário terá privilégios de root. Basta adicionar uma vírgula e o nome do login do usuário ao final da primeira linha do arquivo, pressione <keycap>Esc</keycap>, e use <command>:wq</command>para salvar as alterações no disco e sair. instantaneamente eficaz. (Você não colocou um espaço após a vírgula, colocou?)

source: Other Useful Commands
pt_br: Outros comandos úteis

source: shows file space and mounted systems.
pt_br: mostra o espaço do arquivo e de sistemas montados.

source: shows processes running. <command>ps ax</command> is a narrower form.
pt_br: mostra processos em execução. <command>ps ax</command> é uma forma mais básica do comando.

source: <command>rm <replaceable>filename</replaceable></command>
pt_br: <command>rm <replaceable>arquivo</replaceable></command>

source: remove <replaceable>filename</replaceable>.
pt_br: remove <replaceable>arquivo</replaceable>.

source: removes a directory <replaceable>dir</replaceable> and all subdirectories—careful!
pt_br: removes um diretório <replaceable>dir</replaceable> e todos os subdiretórios—use com cuidado!

source: lists files in the current directory and all subdirectories; I used a variant, <command>ls -AFR &gt; where.txt</command>, to get a list of all the files in <filename>/</filename> and (separately) <filename>/usr</filename> before I found better ways to find files.
pt_br: lista arquivos no diretório atual e em todos os subdiretórios; Eu usei uma variante, <command>ls -AFR &gt; where.txt</command>, para obter uma lista de todos os arquivos em <filename>/</filename> e (separadamente) <filename>/usr</filename> antes de encontrar melhores maneiras de encontrar arquivos.

source: to change user's password (or <systemitem class="username">root</systemitem>'s password)
pt_br: para mudar a senha do usuário (ou a senha do usuário <systemitem class="username">root</systemitem>)

source: manual page on the <trademark class="registered">UNIX</trademark> filesystem
pt_br: exibe páginas do manual do <trademark class="registered">UNIX</trademark> quanto ao sistema de arquivos e sua estrutura hierárquica

source: Use <command>find</command> to locate <filename>filename</filename> in <filename>/usr</filename> or any of its subdirectories with
pt_br: Use <command>find</command> para localizar <filename>arquivo</filename> no diretório <filename>/usr</filename> e subdiretórios

source: <prompt>%</prompt> <userinput>find /usr -name "<replaceable>filename</replaceable>"</userinput>
pt_br: <prompt>%</prompt> <userinput>find /usr -name "<replaceable>arquivo</replaceable>"</userinput>

source: You can use <literal>*</literal> as a wildcard in <parameter>"<replaceable>filename</replaceable>"</parameter> (which should be in quotes). If you tell <command>find</command> to search in <filename>/</filename> instead of <filename>/usr</filename> it will look for the file(s) on all mounted filesystems, including the CDROM and the DOS partition.
pt_br: Você pode usar <literal>*</literal> como um caractere curinga em <parameter>"<replaceable>filename</replaceable>"</parameter> (que deve estar entre aspas). Se você utilizar o <command>find</command> para procurar em <filename>/</filename> em vez de <filename>/usr</filename> ele procurará o(s) arquivo(s) em todos os sistemas de arquivos montados, incluindo o CDROM e a partição DOS.

source: An excellent book that explains <trademark class="registered">UNIX</trademark> commands and utilities is Abrahams &amp; Larson, <citetitle>Unix for the Impatient</citetitle> (2nd ed., Addison-Wesley, 1996). There is also a lot of <trademark class="registered">UNIX</trademark> information on the Internet.
pt_br: Um excelente livro que explica comandos do <trademark class="registered">UNIX</trademark> e ferramentas utilitárias é Abrahams &amp; Larson, <citetitle>Unix for the Impatient</citetitle> (Addison-Wesley, 1996, segunda edição). Há também toneladas de informações na internet sobre <trademark class="registered">UNIX</trademark>.

source: Next Steps
pt_br: Próximos Passos

source: You should now have the tools you need to get around and edit files, so you can get everything up and running. There is a great deal of information in the FreeBSD handbook (which is probably on your hard drive) and <link xlink:href="@@URL_RELPREFIX@@/index.html">FreeBSD's web site</link>. A wide variety of packages and ports are on the CDROM as well as the web site. The handbook tells you more about how to use them (get the package if it exists, with <command>pkg_add /cdrom/packages/All/<replaceable>packagename</replaceable></command>, where <replaceable>packagename</replaceable> is the filename of the package). The CDROM has lists of the packages and ports with brief descriptions in <filename>cdrom/packages/index</filename>, <filename>cdrom/packages/index.txt</filename>, and <filename>cdrom/ports/index</filename>, with fuller descriptions in <filename>/cdrom/ports/*/*/pkg/DESCR</filename>, where the <literal>*</literal>s represent subdirectories of kinds of programs and program names respectively.
pt_br: Agora você deve ter as ferramentas necessárias para explorar e editar arquivos, para que você possa colocar tudo em funcionamento. Há uma grande quantidade de informações no manual do FreeBSD (que provavelmente está no seu disco rígido) e no <link xlink:href="@@URL_RELPREFIX@@/index.html">site oficial do FreeBSD</link>. Uma grande variedade de pacotes e portas estão no CD-ROM e no site. O manual informa mais sobre como usá-los (obtenha o pacote, se existir, com <command>pkg_add /cdrom/packages/All/<replaceable>packagename</replaceable></command>, onde <replaceable>packagename</replaceable> é o nome do pacote). O CDROM possui listas de pacotes e portas com descrições breves em <filename>cdrom/packages/index</filename>, <filename>cdrom/packages/index.txt</filename>, e <filename>cdrom/ports/index</filename>, e descrições completas em <filename>/cdrom/ports/*/*/pkg/DESCR</filename>, onde os <literal>*</literal>s representam subdiretórios de tipos de programas e nomes de programas, respectivamente.

source: If you find the handbook too sophisticated (what with <command>lndir</command> and all) on installing ports from the CDROM, here is what usually works:
pt_br: Se você julgar o manual como sendo muito sofisticado (usando <command>lndir</command> e tudo mais) ao instalar as portas do CDROM, veja a seguir o que geralmente funciona:

source: Find the port you want, say <command>kermit</command>. There will be a directory for it on the CDROM. Copy the subdirectory to <filename>/usr/local</filename> (a good place for software you add that should be available to all users) with:
pt_br: Encontre a porta que você deseja e utilize <command>kermit</command>. Haverá um diretório para ele no CDROM. Copei o subdiretório para <filename>/usr/local</filename> (este é um bom lugar para softwares que você adicione no sistema e que devem estar disponíveis para todos) com:

source: This should result in a <filename>/usr/local/kermit</filename> subdirectory that has all the files that the <command>kermit</command> subdirectory on the CDROM has.
pt_br: Isto deve resultar em um subdiretório <filename>/usr/local/kermit</filename> que possui todos os arquivos que o subdiretório <command>kermit</command> no CDROM possui.

source: Next, create the directory <filename>/usr/ports/distfiles</filename> if it does not already exist using <command>mkdir</command>. Now check <filename>/cdrom/ports/distfiles</filename> for a file with a name that indicates it is the port you want. Copy that file to <filename>/usr/ports/distfiles</filename>; in recent versions you can skip this step, as FreeBSD will do it for you. In the case of <command>kermit</command>, there is no distfile.
pt_br: Em seguida, crie o diretório <filename>/usr/ports/distfiles</filename> se ele ainda não existir <command>mkdir</command>. Agora verifique em <filename>/cdrom/ports/distfiles</filename> um arquivo com um nome que indique a porta que você deseja. Copie esse arquivo para <filename>/usr/ports/distfiles</filename>; você pode pular esse passo em versões recentes, pois o FreeBSD fará isso para você. No caso de <command>kermit</command>, não há distfile.

source: Then <command>cd</command> to the subdirectory of <filename>/usr/local/kermit</filename> that has the file <filename>Makefile</filename>. Type
pt_br: Em seguida, use <command>cd</command> para o subdiretório <filename>/usr/local/kermit</filename> que contém o arquivo <filename>Makefile</filename>. Digite

source: During this process the port will FTP to get any compressed files it needs that it did not find on the CDROM or in <filename>/usr/ports/distfiles</filename>. If you do not have your network running yet and there was no file for the port in <filename>/cdrom/ports/distfiles</filename>, you will have to get the distfile using another machine and copy it to <filename>/usr/ports/distfiles</filename>. Read <filename>Makefile</filename> (with <command>cat</command> or <command>more</command> or <command>view</command>) to find out where to go (the master distribution site) to get the file and what its name is. (Use binary file transfers!) Then go back to <filename>/usr/local/kermit</filename>, find the directory with <filename>Makefile</filename>, and type <command>make all install</command>.
pt_br: Durante este processo, a porta irá usar FTP para obter os arquivos compactados de que precisa e que não encontrou no CDROM ou no <filename>/usr/ports/distfiles</filename>. Se você ainda não tem a sua rede em execução e não havia nenhum arquivo para a porta em <filename>/cdrom/ports/distfiles</filename>, você terá que pegar o distfile usando outra máquina e copiá-lo para <filename>/usr/ports/distfiles</filename>. Leia o <filename>Makefile</filename> (com <command>cat</command> ou <command>more</command> ou <command>view</command>) para descobrir onde ir (o principal site de distribuição) para obter o arquivo e o nome dele. (Use transferências binárias de arquivos!) Em seguida volte para <filename>/usr/local/kermit</filename>, encontre o diretório com <filename>Makefile</filename>, e digite <command>make all install</command>.

source: Your Working Environment
pt_br: Seu ambiente de trabalho

source: Your shell is the most important part of your working environment. The shell is what interprets the commands you type on the command line, and thus communicates with the rest of the operating system. You can also write shell scripts a series of commands to be run without intervention.
pt_br: Seu shell é a parte mais importante do seu ambiente de trabalho. O shell é o que interpreta os comandos que você digita na linha de comando e, assim, se comunica com o restante do sistema operacional. Você também pode escrever scripts de shell, que consiste em uma série de comandos para serem executados sem intervenção.

source: Two shells come installed with FreeBSD: <command>csh</command> and <command>sh</command>. <command>csh</command> is good for command-line work, but scripts should be written with <command>sh</command> (or <command>bash</command>). You can find out what shell you have by typing <command>echo $SHELL</command>.
pt_br: Dois shells vem instalados com o FreeBSD: <command>csh</command> e <command>sh</command>. <command>csh</command> é bom para trabalhos com linha de comando, mas scripts devem ser escritos com o <command>sh</command> (ou <command>bash</command>). Você pode descobrir qual shell você utiliza executando o comando <command>echo $SHELL</command>.
