Repository: dbaio/weblate_fbsd_doc_test
Catalog: articles/*/new-users.po
Languages: pt_br

source: For People New to Both FreeBSD and <trademark class="registered">UNIX</trademark>
pt_br: Aos iniciantes em FreeBSD e <trademark class="registered">UNIX</trademark>

source: FreeBSD is a registered trademark of the FreeBSD Foundation.
pt_br: FreeBSD é uma marca registrada da FreeBSD Foundation.

source: IBM, AIX, OS/2, PowerPC, PS/2, S/390, and ThinkPad are trademarks of International Business Machines Corporation in the United States, other countries, or both.
pt_br: IBM, AIX, OS/2, PowerPC, PS/2, S/390, e ThinkPad são marcas registradas da International Business Machines Corporation nos Estados Unidos, em outros países, ou em ambos.

source: Microsoft, IntelliMouse, MS-DOS, Outlook, Windows, Windows Media and Windows NT are either registered trademarks or trademarks of Microsoft Corporation in the United States and/or other countries.
pt_br: Microsoft, IntelliMouse, MS-DOS, Outlook, Windows, Windows Media e Windows NT são marcas registradas da Microsoft Corporation nos Estados Unidos e/ou em outros países.

source: Motif, OSF/1, and UNIX are registered trademarks and IT DialTone and The Open Group are trademarks of The Open Group in the United States and other countries.
pt_br: Motif, OSF/1 e UNIX são marcas registradas, IT DialTone e The Open Group são marcas comerciais do The Open Group nos Estados Unidos e em outros países.

source: Many of the designations used by manufacturers and sellers to distinguish their products are claimed as trademarks. Where those designations appear in this document, and the FreeBSD Project was aware of the trademark claim, the designations have been followed by the <quote>™</quote> or the <quote>®</quote> symbol.
pt_br: Muitas das designações usadas pelos fabricantes e vendedores para distinguir seus produtos são reivindicadas como marcas registradas. Essas designações aparecem neste documento, e o Projeto FreeBSD estava ciente da reivindicação de marca registrada, as designações foram seguidas pelo símbolo <quote> ™ </quote> ou <quote> ® </quote>.

source: Congratulations on installing FreeBSD! This introduction is for people new to both FreeBSD <emphasis>and</emphasis> <trademark class="registered">UNIX</trademark>—so it starts with basics.
pt_br: Parabéns por instalar o FreeBSD! Esta introdução é para iniciantes em FreeBSD <emphasis>e</emphasis> <trademark class="registered">UNIX</trademark>—então vamos começar do básico.

source: Logging in and Getting Out
pt_br: Logando e Deslogando

source: Log in (when you see <prompt>login:</prompt>) as a user you created during installation or as <systemitem class="username">root</systemitem>. (Your FreeBSD installation will already have an account for <systemitem class="username">root</systemitem>; who can go anywhere and do anything, including deleting essential files, so be careful!) The symbols <prompt>%</prompt> and <prompt>#</prompt> in the following stand for the prompt (yours may be different), with <prompt>%</prompt> indicating an ordinary user and <prompt>#</prompt> indicating <systemitem class="username">root</systemitem>.
pt_br: Logue-se (quando você ver <prompt>login:</prompt>) com o usuário que você criou na instalação ou como <systemitem class="username">root</systemitem>. (Sua instalação do FreeBSD já terá uma conta para o <systemitem class="username">root</systemitem>; esse usuário pode ir a qualquer lugar e fazer qualquer coisa, incluindo deletar arquivos essenciais do sistema, então tenha cuidado!) Os símbolos <prompt>%</prompt> e <prompt>#</prompt> no prompt (o seu pode ser diferente) indicam o tipo do usuário logado, o símbolo <prompt>%</prompt> indica um usuário comum e <prompt>#</prompt> indica que o usuário é <systemitem class="username">root</systemitem>.

source: To log out (and get a new <prompt>login:</prompt> prompt) type
pt_br: Para se deslogar (e obter um novo <prompt>login:</prompt> prompt), digite

source: as often as necessary. Yes, press <keysym>enter</keysym> after commands, and remember that <trademark class="registered">UNIX</trademark> is case-sensitive—<command>exit</command>, not <command>EXIT</command>.
pt_br: quantas vezes forem necessárias. Pressione <keysym>enter</keysym> após digitar os comandos, e lembre-se que <trademark class="registered">UNIX</trademark> diferencia letras maiúsculas de minúsculas, então, digite —<command>exit</command>, e não <command>EXIT</command>.

source: To shut down the machine type
pt_br: Para desligar o computador digite

source: Or to reboot type
pt_br: Ou para reiniciar digite

source: or
pt_br: ou

source: You can also reboot with <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Delete</keycap></keycombo>. Give it a little time to do its work. This is equivalent to <command>/sbin/reboot</command> in recent releases of FreeBSD and is much, much better than hitting the reset button. You do not want to have to reinstall this thing, do you?
pt_br: Você também pode reiniciar com <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Delete</keycap></keycombo>. Aguarde um instante para a conclusão. Esta sequência de teclas é equivalente ao <command>/sbin/reboot</command> nas versões recentes do FreeBSD, e claro, este procedimento é muito, mas muito melhor do que simplesmente pressionar o botão reset do seu computador. Você não quer ter que reinstalar o sistema, não é mesmo?

source: Adding A User with Root Privileges
pt_br: Adicionando Um Usuário com Privilégios de Root

source: If you did not create any users when you installed the system and are thus logged in as <systemitem class="username">root</systemitem>, you should probably create a user now with
pt_br: Se você não criou um usuário quando instalou o sistema operacional e está logado como <systemitem class="username">root</systemitem>, você provavelmente deve criar um usuário com

source: The first time you use <command>adduser</command>, it might ask for some defaults to save. You might want to make the default shell <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry> instead of <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, if it suggests <command>sh</command> as the default. Otherwise just press enter to accept each default. These defaults are saved in <filename>/etc/adduser.conf</filename>, an editable file.
pt_br: A primeira vez que você usar <command> adduser </command>, ele poderá solicitar alguns padrões para salvar. Você pode querer tornar o shell padrão <citerefentry> <refentrytitle>csh</refentrytitle> <manvolnum> 1 </manvolnum> </citerefentry> em vez de <citerefentry> <refentrytitle>sh</refentrytitle> <manvolnum> 1 </manvolnum> </citerefentry>, se for sugerido <command>sh</command> como padrão. Caso contrário, basta pressionar enter para aceitar cada padrão. Esses padrões são salvos em <filename> /etc/adduser.conf </filename>, um arquivo editável.

source: Suppose you create a user <systemitem class="username">jack</systemitem> with full name <emphasis>Jack Benimble</emphasis>. Give <systemitem class="username">jack</systemitem> a password if security (even kids around who might pound on the keyboard) is an issue. When it asks you if you want to invite <systemitem class="username">jack</systemitem> into other groups, type <systemitem class="groupname">wheel</systemitem>
pt_br: Suponha que você crie um usuário <systemitem class="username">jack</systemitem> o qual possui <emphasis>Jack Benimble</emphasis> como nome completo. Dê a <systemitem class="username">jack</systemitem> uma senha se a segurança (até mesmo crianças ao redor que podem esbarrar no teclado) for um problema. Quando perguntarem se você deseja convida <systemitem class="username">jack</systemitem> para outros grupos, digite <systemitem class="groupname">wheel</systemitem>

source: Login group is ``jack''. Invite jack into other groups: <userinput>wheel</userinput>
pt_br: O grupo de login é ``jack''. Convide o jack para outros grupos: <userinput>wheel</userinput>

source: This will make it possible to log in as <systemitem class="username">jack</systemitem> and use the <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> command to become <systemitem class="username">root</systemitem>. Then you will not get scolded any more for logging in as <systemitem class="username">root</systemitem>.
pt_br: Isso tornará possível efetuar login como <systemitem class="username">jack</systemitem> e usar o comando <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum> </citerefentry>para tornar-se <systemitem class="username"> root </systemitem>. Dessa forma, você não será mais repreendido por fazer login como <systemitem class="username">root</systemitem>.

source: You can quit <command>adduser</command> any time by typing <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo>, and at the end you will have a chance to approve your new user or simply type <keycap>n</keycap> for no. You might want to create a second new user so that when you edit <systemitem class="username">jack</systemitem>'s login files, you will have a hot spare in case something goes wrong.
pt_br: Você pode sair do <command>adduser</command> a qualquer momento digitando <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo>, e no final você terá a chance de aprovar seu novo usuário ou simplesmente digitar <keycap>n</keycap> para não criá-lo. Você pode querer criar um segundo novo usuário para que ao editar os arquivos de login do <systemitem class="username">jack</systemitem>, você tenha um hot spare caso algo dê errado.

source: Once you have done this, use <command>exit</command> to get back to a login prompt and log in as <systemitem class="username">jack</systemitem>. In general, it is a good idea to do as much work as possible as an ordinary user who does not have the power—and risk—of <systemitem class="username">root</systemitem>.
pt_br: Depois de fazer isso, use <command>exit</command> para voltar a um prompt de login e efetuar login como <systemitem class="username">jack</systemitem>. Em geral, é uma boa ideia fazer o máximo possível de trabalho como um usuário comum que não tenha o poder -e risco- de <systemitem class="username">root</systemitem>.

source: If you already created a user and you want the user to be able to <command>su</command> to <systemitem class="username">root</systemitem>, you can log in as <systemitem class="username">root</systemitem> and edit the file <filename>/etc/group</filename>, adding <systemitem class="username">jack</systemitem> to the first line (the group <systemitem class="groupname">wheel</systemitem>). But first you need to practice <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry>, the text editor—or use the simpler text editor, <citerefentry><refentrytitle>ee</refentrytitle><manvolnum>1</manvolnum></citerefentry>, installed on recent versions of FreeBSD.
pt_br: Se você já criou um usuário e deseja que o usuário seja capaz de executar o comando <command>su</command> para logar-se como <systemitem class="username">root</systemitem>, é possível efetuar login como <systemitem class="username">root</systemitem> e editar o arquivo <filename>/etc/group</filename>, adicionando <systemitem class="username">jack</systemitem> à primeira linha (o grupo <systemitem class="groupname">roda</systemitem>). Mas primeiro você precisa praticar <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry>, o editor de texto - ou usar um editor de texto mais simples, por exemplo, <citerefentry> <refentrytitle>ee</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, instalado em versões recentes do FreeBSD.

source: To delete a user, use the <command>rmuser</command> command.
pt_br: Para excluir um usuário, use o comando <command>rmuser</command>.

source: Looking Around
pt_br: Explorando

source: Logged in as an ordinary user, look around and try out some commands that will access the sources of help and information within FreeBSD.
pt_br: Logado como um usuário comum, olhe ao redor e experimente alguns comandos que acessarão as fontes de ajuda e informações dentro do FreeBSD.

source: Here are some commands and what they do:
pt_br: Aqui estão descritos alguns comandos e o que eles fazem:

source: Tells you who you are!
pt_br: Diz a você quem você é!

source: Shows you where you are—the current working directory.
pt_br: Mostra onde você está—quanto ao diretório atual de trabalho.

source: Lists the files in the current directory.
pt_br: Lista os arquivos presentes no diretório atual.

source: Lists the files in the current directory with a <literal>*</literal> after executables, a <literal>/</literal> after directories, and an <literal>@</literal> after symbolic links.
pt_br: Lista os arquivos do diretório atual com um <literal>*</literal> depois dos executáveis, um <literal>/</literal> depois dos diretórios, e um <literal>@</literal> depois de vínculos simbólicos.

source: Lists the files in long format—size, date, permissions.
pt_br: Lista os arquivos em formatos estendidos—tamanho, data, permissões.

source: Lists hidden <quote>dot</quote> files with the others. If you are <systemitem class="username">root</systemitem>, the <quote>dot</quote> files show up without the <option>-a</option> switch.
pt_br: Lista arquivos <quote>dot</quote> junto com os outros. Se você é <systemitem class="username">root</systemitem>, os arquivos <quote>dot</quote> serão mostradas sem a opção <option>-a</option>.

source: Changes directories. <command>cd ..</command> backs up one level; note the space after <command>cd</command>. <command>cd /usr/local</command> goes there. <command>cd ~</command> goes to the home directory of the person logged in—e.g., <filename>/usr/home/jack</filename>. Try <command>cd /cdrom</command>, and then <command>ls</command>, to find out if your CDROM is mounted and working.
pt_br: Altera o diretório atual de trabalho. <command>cd ..</command> te leva ao diretório antecessor do atual; note o espaço depois de <command>cd</command>. <command>cd /usr/local</command> te leva a esse mesmo diretório. <command>cd ~</command> te leva ao diretório home do usuário que você está logado—exemplo: <filename>/usr/home/jack</filename>. Tente <command>cd /cdrom</command>, e depois <command>ls</command>, para saber se o CDROM está montado e funcionando.

source: <command>less <replaceable>filename</replaceable></command>
pt_br: <command>less <replaceable>arquivo</replaceable></command>

source: Lets you look at a file (named <replaceable>filename</replaceable>) without changing it. Try <command>less /etc/fstab</command>. Type <command>q</command> to quit.
pt_br: Te permite ver um arquivo (chamado <replaceable>filename</replaceable>) sem alterá-lo. Tente <command>less /etc/fstab</command>. Digite <command>q</command> para sair.

source: <command>cat <replaceable>filename</replaceable></command>
pt_br: <command>cat <replaceable>arquivo</replaceable></command>

source: Displays <replaceable>filename</replaceable> on screen. If it is too long and you can see only the end of it, press <keycap>ScrollLock</keycap> and use the <keycap>up-arrow</keycap> to move backward; you can use <keycap>ScrollLock</keycap> with manual pages too. Press <keycap>ScrollLock</keycap> again to quit scrolling. You might want to try <command>cat</command> on some of the dot files in your home directory—<command>cat .cshrc</command>, <command>cat .login</command>, <command>cat .profile</command>.
pt_br: Exibe o conteúdo do arquivo <replaceable>filename</replaceable> na tela. Se o conteúdo for muito longo você puder ver apenas o final, pressione <keycap>ScrollLock</keycap> e use <keycap>up-arrow</keycap> para retroceder; você pode usar <keycap>ScrollLock</keycap> em páginas de manual também. Pressione <keycap>ScrollLock</keycap> novamente para parar de rolar. Você também pode querer experimentar <command>cat</command> em alguns arquivos dot em sua home—<command>cat .cshrc</command>, <command>cat .login</command>, <command>cat .profile</command>.

source: You will notice aliases in <filename>.cshrc</filename> for some of the <command>ls</command> commands (they are very convenient). You can create other aliases by editing <filename>.cshrc</filename>. You can make these aliases available to all users on the system by putting them in the system-wide <command>csh</command> configuration file, <filename>/etc/csh.cshrc</filename>.
pt_br: Você notará os aliases em <filename>.cshrc</filename> para alguns dos comandos <command>ls</command>. (Eles são muito convenientes). Você pode criar aliases ao editar <filename>.cshrc</filename>. Você pode disponibilizar esses aliases para todos os usuários do sistema, colocando-os no arquivo de configuração <command>csh</command> em <filename>/etc/csh.cshrc</filename>.

source: Getting Help and Information
pt_br: Obtendo ajuda e informações

source: Here are some useful sources of help. <replaceable>Text</replaceable> stands for something of your choice that you type in—usually a command or filename.
pt_br: Aqui estão algumas fontes úteis de ajuda.<replaceable>Texto</replaceable> é mantido para algo de sua escolha—geralmente um comando ou nome de arquivo.

source: <command>apropos <replaceable>text</replaceable></command>
pt_br: <command>apropos<replaceable>texto</replaceable></command>

source: Everything containing string <replaceable>text</replaceable> in the <database>whatis database</database>.
pt_br: Tudo que contém <replaceable>text</replaceable> na <database>whatis database</database>.

source: <command>man <replaceable>text</replaceable></command>
pt_br: <command>man <replaceable>texto</replaceable></command>

source: The manual page for <replaceable>text</replaceable>. The major source of documentation for <trademark class="registered">UNIX</trademark> systems. <command>man ls</command> will tell you all the ways to use the <command>ls</command> command. Press <keycap>Enter</keycap> to move through text, <keycombo><keycap>Ctrl</keycap><keycap>B</keycap></keycombo> to go back a page, <keycombo><keycap>Ctrl</keycap><keycap>F</keycap></keycombo> to go forward, <keycap>q</keycap> or <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo> to quit.
pt_br: A página de manual do <replaceable>text</replaceable>. A principal fonte de documentação para os sistemas <trademark class="registered">UNIX</trademark>. <command>man ls</command>lhe dirá todas as maneiras de usar o comando <command>ls</command> command. Pressione <keycap>Enter</keycap> para percorrer o texo, <keycombo><keycap>Ctrl</keycap><keycap>B</keycap></keycombo> para voltar a página anterior, <keycombo><keycap>Ctrl</keycap><keycap>F</keycap></keycombo> para avançar, <keycap>q</keycap> ou <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo> para sair.

source: <command>which <replaceable>text</replaceable></command>
pt_br: <command>which <replaceable>texto</replaceable></command>

source: Tells you where in the user's path the command <replaceable>text</replaceable> is found.
pt_br: Te informa em qual local no caminho do usuário o comando <replaceable>text</replaceable> é encontrado.

source: <command>locate <replaceable>text</replaceable></command>
pt_br: <command>locate <replaceable>texto</replaceable></command>

source: All the paths where the string <replaceable>text</replaceable> is found.
pt_br: Todos os caminhos onde a string <replaceable>text</replaceable> é encontrado.

source: <command>whatis <replaceable>text</replaceable></command>
pt_br: <command>whatis <replaceable>texto</replaceable></command>

source: Tells you what the command <replaceable>text</replaceable> does and its manual page. Typing <command>whatis *</command> will tell you about all the binaries in the current directory.
pt_br: Te informa o que o comando <replaceable>text</replaceable> faz e sua página de manual. Digitando <command>whatis *</command> a saída do comando te informará sobre todos os binários no diretório atual.

source: <command>whereis <replaceable>text</replaceable></command>
pt_br: <command>whereis <replaceable>texto</replaceable></command>

source: Finds the file <replaceable>text</replaceable>, giving its full path.
pt_br: Encontra o arquivo <replaceable>text</replaceable>, te informando seu caminho completo.

source: You might want to try using <command>whatis</command> on some common useful commands like <command>cat</command>, <command>more</command>, <command>grep</command>, <command>mv</command>, <command>find</command>, <command>tar</command>, <command>chmod</command>, <command>chown</command>, <command>date</command>, and <command>script</command>. <command>more</command> lets you read a page at a time as it does in DOS, e.g., <command>ls -l | more</command> or <command>more <replaceable>filename</replaceable></command>. The <literal>*</literal> works as a wildcard—e.g., <command>ls w*</command> will show you files beginning with <literal>w</literal>.
pt_br: Você pode experimentar usar <command>whatis</command> em alguns comandos utéis e comuns como <command>cat</command>, <command>more</command>, <command>grep</command>, <command>mv</command>, <command>find</command>, <command>tar</command>, <command>chmod</command>, <command>chown</command>, <command>date</command>, e <command>script</command>. <command>more</command> te permite ler uma página por vez como no DOS, exemplo: <command>ls -l | more</command> ou <command>more <replaceable>filename</replaceable></command>. O símbolo <literal>*</literal> funciona como um caracter curinga—exemplo: <command>ls w*</command> mostrará os arquivos que começam com <literal>w</literal>.

source: Are some of these not working very well? Both <citerefentry><refentrytitle>locate</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry><refentrytitle>whatis</refentrytitle><manvolnum>1</manvolnum></citerefentry> depend on a database that is rebuilt weekly. If your machine is not going to be left on over the weekend (and running FreeBSD), you might want to run the commands for daily, weekly, and monthly maintenance now and then. Run them as <systemitem class="username">root</systemitem> and, for now, give each one time to finish before you start the next one.
pt_br: Alguns deles não estão funcionado muito bem? Ambos <citerefentry><refentrytitle>locate</refentrytitle><manvolnum>1</manvolnum></citerefentry> e <citerefentry><refentrytitle>whatis</refentrytitle><manvolnum>1</manvolnum></citerefentry> dependem de um banco de dados que é reconstruído semanalmente. Se a sua máquina não for ficar ligada nos fins de semana (e rodando FreeBSD), você pode executar os comandos a seguir para manutenção diariamente, semanalmente, mensalmente ou de vez em quando. Execute-os como <systemitem class="username">root</systemitem> e dê a cada comando o tempo necessário para ser finalizado antes de executar o próximo.
