Repository: dbaio/weblate_fbsd_doc_test
Catalog: articles/*/new-users.po
Languages: pt_br

source: The <command>csh</command> shell is okay, but <command>tcsh</command> does everything <command>csh</command> does and more. It allows you to recall commands with the arrow keys and edit them. It has tab-key completion of filenames (<command>csh</command> uses the <keycap>Esc</keycap> key), and it lets you switch to the directory you were last in with <command>cd -</command>. It is also much easier to alter your prompt with <command>tcsh</command>. It makes life a lot easier.
pt_br: O <command>csh</command> é bom, mas <command>tcsh</command> faz tudo que o <command>csh</command> faz e ainda mais. Ele permite recuperar comandos com as teclas de seta e editá-los. Ele tem a chave tab-complete de nomes de arquivos (<command>csh</command> usa a tecla <keycap>Esc</keycap>), e permite alternar o diretório em que você estava por último com o comando <command>cd -</command>. E também é muito mais fácil alterar o seu prompt com o <command>tcsh</command>. Ele tornar sua vida muito mais fácil.

source: Here are the three steps for installing a new shell:
pt_br: Aqui estão os três passos para instalar um novo shell:

source: Install the shell as a port or a package, just as you would any other port or package.
pt_br: Instale o shell como uma porta ou um pacote, como faria com qualquer outra porta ou pacote.

source: Use the <command>chsh</command> command to change your shell to <command>tcsh</command> permanently, or type <command>tcsh</command> at the prompt to change your shell without logging in again.
pt_br: Use o comando <command>chsh</command> para alterar permanentemente seu shell para <command>tcsh</command>, ou digite <command>tcsh</command> no prompt para alterar seu shell sem precisar efetuar login novamente.

source: It can be dangerous to change <systemitem class="username">root</systemitem>'s shell to something other than <command>sh</command> or <command>csh</command> on early versions of FreeBSD and many other versions of <trademark class="registered">UNIX</trademark>; you may not have a working shell when the system puts you into single user mode. The solution is to use <command>su -m</command> to become <systemitem class="username">root</systemitem>, which will give you the <command>tcsh</command> as <systemitem class="username">root</systemitem>, because the shell is part of the environment. You can make this permanent by adding it to your <filename>.tcshrc</filename> file as an alias with:
pt_br: Pode ser perigoso alterar o shell do usuário <systemitem class="username">root</systemitem> para outro diferente do <command>sh</command> ou <command>csh</command> em versões anteriores do FreeBSD e também em muitas outras versões de <trademark class="registered">UNIX</trademark>; talvez você não tenha um shell funcional quando o sistema o coloca no modo de usuário único. A solução é usar <command>su -m</command> para se tornar <systemitem class="username">root</systemitem>, o que lhe dá o <command>tcsh</command> como <systemitem class="username">root</systemitem>, por que o shell faz parte do ambiente. Você pode tornar isso permanente adicionando-o ao seu arquivo <filename>.tcshrc</filename>como um alias, para isso, execute:

source: When <command>tcsh</command> starts up, it will read the <filename>/etc/csh.cshrc</filename> and <filename>/etc/csh.login</filename> files, as does <command>csh</command>. It will also read the <filename>.login</filename> file in your home directory and the <filename>.cshrc</filename> file as well, unless you provide a <filename>.tcshrc</filename> file. This you can do by simply copying <filename>.cshrc</filename> to <filename>.tcshrc</filename>.
pt_br: Quando o <command>tcsh</command> é iniciado, ele lê os arquivos <filename>/etc/csh.cshrc</filename> e <filename>/etc/csh.login</filename>, assim como o <command>csh</command>. Ele também lerá o arquivo <filename>.login</filename> no seu diretório home e o arquivo <filename>.cshrc</filename>, a menos que você forneça um arquivo <filename>.tcshrc</filename>. Isso você fazer simplesmente copiando <filename>.cshrc</filename> para <filename>.tcshrc</filename>.

source: Now that you have installed <command>tcsh</command>, you can adjust your prompt. You can find the details in the manual page for <command>tcsh</command>, but here is a line to put in your <filename>.tcshrc</filename> that will tell you how many commands you have typed, what time it is, and what directory you are in. It also produces a <literal>&gt;</literal> if you are an ordinary user and a <literal>#</literal> if you are <systemitem class="username">root</systemitem>, but tsch will do that in any case:
pt_br: Agora que você instalou o <command>tcsh</command>, você pode ajustar o seu prompt. Você pode encontrar os detalhes na página de manual do <command>tcsh</command>, mas aqui está uma linha para colocar em seu <filename>.tcshrc</filename> que informará quantos comandos você digitou, a que horas ele é, e em qual diretório você está. Ele também produz um <literal>&gt;</literal> se você for um usuário comum e <literal>#</literal>se você for <systemitem class="username">root</systemitem>,mas o tcsh fará isso em qualquer caso:

source: This should go in the same place as the existing set prompt line if there is one, or under "if($?prompt) then" if not. Comment out the old line; you can always switch back to it if you prefer it. Do not forget the spaces and quotes. You can get the <filename>.tcshrc</filename> reread by typing <command>source .tcshrc</command>.
pt_br: Isso deve ser inserido exatamente na linha de prompt que a opção está, ou abaixo de "if($?prompt) then" caso ela não exista. Comente a linha antiga; você sempre pode voltar a ela se preferir. Não esqueça os espaços e aspas. Você pode obter a releitura do <filename>.tcshrc</filename> digitando <command>source .tcshrc</command>.

source: You can get a listing of other environmental variables that have been set by typing <command>env</command> at the prompt. The result will show you your default editor, pager, and terminal type, among possibly many others. A useful command if you log in from a remote location and can not run a program because the terminal is not capable is <command>setenv TERM vt100</command>.
pt_br: Você pode obter uma listagem de outras variáveis de ambiente que foram configuradas digitando <command>env</command> no prompt. O resultado mostrará seu editor padrão, pager e tipo de terminal, entre possivelmente muitos outros. Um comando útil se você efetuar login de um local remoto e não puder executar um programa porque o terminal não é capaz é <command>setenv TERM vt100</command>.

source: Other
pt_br: Outros

source: As <systemitem class="username">root</systemitem>, you can unmount the CDROM with <command>/sbin/umount /cdrom</command>, take it out of the drive, insert another one, and mount it with <command>/sbin/mount_cd9660 /dev/cd0a /cdrom</command> assuming <hardware>cd0a</hardware> is the device name for your CDROM drive. The most recent versions of FreeBSD let you mount the CDROM with just <command>/sbin/mount /cdrom</command>.
pt_br: Como <systemitem class="username">root</systemitem>, você pode desmontar o CDROM com o comando <command>/sbin/umount /cdrom</command>, retire-o da unidade, insira outro e monte-o com <command>/sbin/mount_cd9660 /dev/cd0a /cdrom</command> considerando <hardware>cd0a</hardware> é o nome do dispositivo da sua unidade de CDROM. As versões mais recentes do FreeBSD permitem montar o CDROM com apenas o comando <command>/sbin/mount /cdrom</command>.

source: Using the live filesystem—the second of FreeBSD's CDROM disks—is useful if you have got limited space. What is on the live filesystem varies from release to release. You might try playing games from the CDROM. This involves using <command>lndir</command>, which gets installed with the X Window System, to tell the program(s) where to find the necessary files, because they are in the <filename>/cdrom</filename> file system instead of in <filename>/usr</filename> and its subdirectories, which is where they are expected to be. Read <command>man lndir</command>.
pt_br: Usando os arquivos de sistema live—o segundo dos discos de CDROM do FreeBSD—é útil se você tiver espaço limitado. O que está no sistema de arquivos live varia de lançamento para lançamento. Você pode tentar jogar jogos no CDROM. Isso envolve o uso do <command>lndir</command>, que é instalado com o X Window System, para informar ao(s) programa(s) onde encontrar os arquivos necessários, porque eles estão no sistema de arquivos <filename>/cdrom</filename> em vez de <filename>/usr</filename> e seus subdiretórios, que é onde eles devem estar. Leia <command>man lndir</command>.

source: Comments Welcome
pt_br: Comentários são bem-vindos

source: If you use this guide I would be interested in knowing where it was unclear and what was left out that you think should be included, and if it was helpful. My thanks to Eugene W. Stark, professor of computer science at SUNY-Stony Brook, and John Fieber for helpful comments.
pt_br: Se você usar este guia, eu estaria interessada em saber onde pode não ter ficado claro e o que foi deixado de fora que você acha que deveria ser incluído, e também os informar se foi útil para você. Meus agradecimentos a Eugene W. Stark, professor de ciência da computação na SUNY-Stony Brook, e John Fieber por comentários úteis.
